# 游戏数据配置
ENEMIES = {
    "迷雾癞蛤蟆": {"name": "迷雾癞蛤蟆", "hp": 90, "attack": 13, "spd": 5, "drop": {"蛤蟆球": 1}},
    "迷雾石人": {"name": "迷雾石人", "hp": 365, "attack": 35, "spd": 8, "drop": {"魔法石板": 1}},
    "乐特蜂": {"name": "乐特蜂", "hp": 125, "attack": 38, "spd": 43, "drop": {"乐特蜂针": 1}},
    "苔藓石人": {"name": "苔藓石人", "hp": 1210, "attack": 72, "spd": 10, "drop": {"中级魔法石板": 1}},
    "黑暗勇士": {"name": "黑暗勇士", "hp": 425, "attack": 47, "spd": 25, "drop": {"魔力之石": 1}},
    "狩猎士兵": {"name": "狩猎士兵", "hp": 515, "attack": 38, "spd": 26, "drop": {"勇士之剑": 0.5, "魔力之石": 0.5}},
    "高级狩猎士兵": {"name": "高级狩猎士兵", "hp": 1430, "attack": 178, "spd": 50, "drop": {"勇士之剑": 0.5, "魔力之石": 0.5}},
    "狩猎队长": {"name": "狩猎队长", "hp": 4450, "attack": 331, "spd": 41, "drop": {"勇士之剑": 0.5, "魔力之石": 0.5}},
    "迷雾丛林树精灵": {"name": "迷雾丛林树精灵", "hp": 5520, "attack": 118, "spd": 15, "drop": {"精灵的木片": 1}},
    "施维茨": {"name": "施维茨", "hp": 1820, "attack": 62, "spd": 24, "drop": {"施维茨的胳膊": 1}},
    "拉博乐": {"name": "拉博乐", "hp": 2620, "attack": 80, "spd": 15, "drop": {"拉博乐的犄角": 1}},
    "黑暗怪物": {"name": "黑暗怪物", "hp": 3420, "attack": 131, "spd": 34, "drop": {"巨型魔力之石": 1}},
    "巴萨特石人": {"name": "巴萨特石人", "hp": 3300, "attack": 94, "spd": 15, "drop": {"高级魔法石板": 0.5, "玄武岩": 1}},
    "拉博列德": {"name": "拉博列德", "hp": 41700, "attack": 488, "spd": 15, "drop": {"拉博列德的心脏": 1}},
    "雷特力诺": {"name": "雷特力诺", "hp": 57800, "attack": 100, "spd": 15, "drop": {"雷特力诺之角": 1}},
    "克雷巴斯": {"name": "克雷巴斯", "hp": 63200, "attack": 318, "spd": 12, "drop": {"克雷巴斯之手": 1}},
    "上古龙": {"name": "上古龙", "hp": 81200, "attack": 512, "spd": 25, "drop": {"上古龙之角": 1}}
}

EQUIPMENTS = {
    "匕首": {"name": "匕首", "type": "weapon", "attr": {"ATN": 2, "SPD": 4}},
    "精灵枪贝尔克里斯": {"name": "精灵枪贝尔克里斯", "type": "weapon", "attr": {"ATN": 10, "INT": 10, "SPD": 5}},
    "布衣": {"name": "布衣", "type": "armor", "attr": {"DEF": 2, "SPD": 1}}
}

ITEMS = {
    "红色小鲵的珠子": {"type": "material", "price": 10},
    "铃棉花": {"type": "material", "price": 10},
    "黄色石粉": {"type": "material", "price": 15},
    "迷雾叶": {"type": "material", "price": 15},
    "冰石块": {"type": "material", "price": 20},
    "闪耀冰晶": {"type": "material", "price": 20},
    "精灵树枯枝": {"type": "material", "price": 50},
    "蜥蜴尾巴": {"type": "material", "price": 15}
}

CRAFT_RECIPES = {
    "消耗品": {
        "闪耀水晶": {"拉博列德的心脏": 1, "克雷巴斯之手": 1, "雷特力诺之角": 1},
    },

    "武器": {
        "精灵枪贝尔克里斯": {"迷雾叶": 10, "蛤蟆球": 10, "铃棉花": 10, "精灵树枯枝": 1},
    },

    "服装": {
        "布衣": {"铃棉花": 4},
    },

    "主魔法阵": {
        "火焰柱魔法阵": {"魔法石板": 1, "红色小鲵的珠子": 5, "迷雾叶": 5, "黄色石粉": 1},
        "定点爆炸魔法阵": {"中级魔法石板": 1, "拉博乐的犄角": 2, "魔力之石": 2},
        "拉博列德心脏": {"高级魔法石板": 1, "拉博列德的心脏": 1, "玄武岩": 1, "巨型魔力之石": 1},
        "雷电雨魔法阵": {"魔法石板": 1, "乐特蜂针": 3, "魔力之石": 1},
        "闪电球魔法阵": {"中级魔法石板": 1, "乐特蜂针": 5, "巨型魔力之石": 1},
        "雷特力诺封印": {"高级魔法石板": 1, "雷特力诺之角": 1, "乐特蜂针": 5},
        "冰狱魔法阵": {"魔法石板": 1, "闪耀冰晶": 3, "冰石块": 3},
        "冰雨魔法阵": {"中级魔法石板": 1, "闪耀冰晶": 5, "施维茨的胳膊": 1},
        "七柱克雷巴斯之手": {"高级魔法石板": 1, "克雷巴斯之手": 1, "施维茨的胳膊": 1, "冰石块": 5},
        "治愈魔法阵": {"魔法石板": 1, "蜥蜴尾巴": 2, "迷雾叶": 1},
        "高级治愈魔法阵": {"中级魔法石板": 1, "迷雾叶": 6, "精灵的木片": 1},
    },

    "辅助魔法阵": {
        "低级增幅魔法阵": {"魔法石板": 1, "红色小鲵的珠子": 3, "黄色石粉": 2},
        "中级增幅魔法阵": {"中级魔法石板": 1, "黄色石粉": 3, "魔力之石": 1},
        "高级增幅魔法阵": {"高级魔法石板": 1, "黄色石粉": 5, "玄武岩": 1},
        "低级凝神魔法阵": {"魔法石板": 1, "蛤蟆球": 3},
        "中级凝神魔法阵": {"中级魔法石板": 1, "蛤蟆球": 3, "迷雾叶": 5},
        "高级凝神魔法阵": {"高级魔法石板": 1, "精灵的木片": 1, "魔力之石": 5}
    }
}

MAGIC_MATRIX = {
    "火焰柱魔法阵": {"name": "火焰柱魔法阵", "type": "main", "power": 35, "boost": 0.1, "cost": 10},
    "定点爆炸魔法阵": {"name": "定点爆炸魔法阵", "type": "main", "power": 500, "boost": 3.5, "cost": 120},
    "拉博列德心脏": {"name": "拉博列德心脏", "type": "main", "power": 950, "boost": 6.4, "cost": 400},

    "雷电雨魔法阵": {"name": "雷电雨魔法阵", "type": "main", "power": 150, "boost": 1.5, "cost": 60},
    "闪电球魔法阵": {"name": "闪电球魔法阵", "type": "main", "power": 650, "boost": 5, "cost": 250},
    "雷特力诺封印": {"name": "雷特力诺封印", "type": "main", "power": 1020, "boost": 7.8, "cost": 600},

    "冰狱魔法阵": {"name": "冰狱魔法阵", "type": "main", "power": 125, "boost": 0.8, "cost": 32},
    "冰雨魔法阵": {"name": "冰雨魔法阵", "type": "main", "power": 400, "boost": 3, "cost": 80},
    "七柱克雷巴斯之手": {"name": "七柱克雷巴斯之手", "type": "main", "power": 840, "boost": 5.8, "cost": 250},

    "治愈魔法阵": {"name": "治愈魔法阵", "type": "main", "power": 50, "boost": 0.5, "cost": 15},
    "高级治愈魔法阵": {"name": "高级治愈魔法阵", "type": "main", "power": 135, "boost": 2, "cost": 40},


    "低级增幅魔法阵": {"name": "低级增幅魔法阵", "type": "amplify", "boost": 0.2, "reduce": 0.5},
    "中级增幅魔法阵": {"name": "低级增幅魔法阵", "type": "amplify", "boost": 0.4, "reduce": 1},
    "高级增幅魔法阵": {"name": "低级增幅魔法阵", "type": "amplify", "boost": 0.6, "reduce": 1.5},
    "低级凝神魔法阵": {"name": "低级凝神魔法阵", "type": "focus", "boost": 0, "reduce": 0.2},
    "中级凝神魔法阵": {"name": "低级凝神魔法阵", "type": "focus", "boost": 0, "reduce": 0.3},
    "高级凝神魔法阵": {"name": "低级凝神魔法阵", "type": "focus", "boost": 0, "reduce": 0.45}
}

EXERCISES = {
    "俯卧撑": {"base_atn": 0.03, "base_def": 0.01},
    "拳击": {"base_atn": 0.02, "base_spd": 0.01},
    "跑步": {"base_hp": 0.03},
    "剑术": {"base_hp": 0.01, "base_spd": 0.02},
    "魔法研究": {"base_int": 0.01, "base_mp": 0.02},
    "制作研究": {"base_mp": 0.03},
    "魔力凝聚": {"base_int": 0.02, "base_mp": 0.01},
    "魔力爆发": {"base_int": 0.02, "base_mp": 0.01, "base_hp": 0.01}
}

CONSUMABLES = {
    "闪耀水晶": {"all": 0.2},
    "电子针": {"base_spd": 7}
}